package day8;
/*--------------------------static------------------------------
 * 제어자 
 * 1)멤버변수와 메서드 앞에 지정 가능하다.
 * 2)자동으로 사용가능한 상태가 된다. 
 * 3)static을 설정한 멤버변수와 메서드는 객체생성을 하지 않아도 자동으로 메모리영역을 할당하거나
 * 호출 가능한 상태가 된다. 
 * 4)static이 붙어있으면 객체생성을 이미 한 것이나 다름없다. 
 * 5)다른 클래스에서 또 다른 클래스의 static타입의 멤버를 사용할 때는 클래스명,멤버명으로 사용한다. 
 * 6) 클래스에 정의되는 멤버들중 어떤 멤버에게 static을 부여하는가???
 * ----변수(멤버) static 변수는 클래스 내 인스턴스마다  고정시켜야 하는 것을 만들때 사용한다.
 * 쉽게 말해 클래스 내의 공통적인 사항이 있을 시에 static을 사용한다. 
 * ----메서드
 * */
public class static_Test {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
